TaskManager/app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
	@tasks = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
  	@tasks = Task.find(params[:id])

INSERT INTO "tasks" ("user", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user", "u"], ["email", "t@r.ru"], ["created_at", "2016-06-07 17:18:50.296189"], ["updated_at", "2016-06-07 17:18:50.296189"]]
---
  def create
  	@tasks = Task.new(tasks_params)

  	if @tasks.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "tasks" SET "email" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["email", "333333333333333333333333333333"], ["updated_at", "2016-06-07 20:03:58.213045"], ["id", 10]]
---
  def update
  	@tasks = Task.find(params[:id])

  	if @tasks.update(tasks_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
  	@tasks = Task.find(params[:id])
  	@tasks.destroy